In [1]:
import pandas as pd

In [ ]:
pd.to_datetime() – Convert to datetime format.
df['date'].dt.year – Extract the year from a datetime column.
df['date'].dt.month – Extract the month from a datetime column.
df['date'].dt.day – Extract the day from a datetime column.
df['date'].dt.weekday – Extract the weekday.
df['date'].dt.isocalendar() – Get the ISO calendar year, week, and day.
df['date'].dt.month_name() – Get the name of the month.
df['date'].dt.strftime() – Convert a datetime to a string with a custom format.
df.resample() – Resample time series data.
df.shift() – Shift data by a specified number of periods.
df.diff() – Calculate the difference between consecutive data points.

In [2]:
df = pd.DataFrame({"Id":[1,2,3,4,5],
                   "name":['a','b','c','d','e'],
                   "city":['p','q','r','s','t'],
                   "doj":['03-05-2025','01-12-2024','04-05-2021','01-01-2020','04-03-2021']})

In [3]:
df

   Id name city         doj
0   1    a    p  03-05-2025
1   2    b    q  01-12-2024
2   3    c    r  04-05-2021
3   4    d    s  01-01-2020
4   5    e    t  04-03-2021

In [4]:
df.dtypes

Id       int64
name    object
city    object
doj     object
dtype: object

In [11]:
df['doj_date'] = pd.to_datetime(df['doj'],format="%d-%m-%Y")

In [12]:
df

   Id name city         doj   doj_date
0   1    a    p  03-05-2025 2025-05-03
1   2    b    q  01-12-2024 2024-12-01
2   3    c    r  04-05-2021 2021-05-04
3   4    d    s  01-01-2020 2020-01-01
4   5    e    t  04-03-2021 2021-03-04

In [8]:
df.dtypes

Id                   int64
name                object
city                object
doj                 object
doj_date    datetime64[ns]
dtype: object

In [ ]:
file read -- object -- date

In [13]:
df

   Id name city         doj   doj_date
0   1    a    p  03-05-2025 2025-05-03
1   2    b    q  01-12-2024 2024-12-01
2   3    c    r  04-05-2021 2021-05-04
3   4    d    s  01-01-2020 2020-01-01
4   5    e    t  04-03-2021 2021-03-04

In [14]:
df['doj_date'].dt.day

0    3
1    1
2    4
3    1
4    4
Name: doj_date, dtype: int32

In [19]:
df['doj_date'].dt.month_name()

0         May
1    December
2         May
3     January
4       March
Name: doj_date, dtype: object

In [17]:
df['doj_date'].dt.year

0    2025
1    2024
2    2021
3    2020
4    2021
Name: doj_date, dtype: int32

In [24]:
df['test'] = df['doj_date'].dt.strftime("%y-%d-%m")

In [ ]:
date --- data type --> Process

In [ ]:
Group by:
==========

In [108]:
df = pd.read_csv("temp.csv")

In [32]:
df.groupby('product').agg("price").sum()

product
Keyboard     165
Laptop      5150
Monitor      630
Mouse         39
Name: price, dtype: int64

In [33]:
df.groupby('product').agg("quantity").count()

product
Keyboard    4
Laptop      4
Monitor     3
Mouse       4
Name: quantity, dtype: int64

In [109]:
df.rename({"price":"sales"},axis=1,inplace=True)

In [37]:
df.groupby(["region","product"]).agg("sales").sum()

region  product
East    Keyboard      83
        Laptop      1250
        Mouse         10
North   Keyboard      42
        Laptop      1200
        Monitor      200
        Mouse         12
South   Keyboard      40
        Monitor      210
        Mouse         17
West    Laptop      2700
        Monitor      220
Name: sales, dtype: int64

In [40]:
df.groupby(["sale_date","product"]).agg("sales").sum()

sale_date   product
2024-01-05  Laptop      1200
2024-01-07  Keyboard      40
2024-01-08  Mouse         10
2024-01-10  Monitor      200
2024-01-12  Laptop      1300
            Mouse          8
2024-01-15  Mouse         12
2024-01-16  Keyboard      45
2024-01-17  Monitor      210
2024-01-20  Laptop      1400
2024-01-21  Laptop      1250
2024-01-22  Keyboard      42
2024-01-23  Mouse          9
2024-01-25  Monitor      220
2024-01-26  Keyboard      38
Name: sales, dtype: int64

In [43]:
df.groupby(["customer","sale_date","product"]).agg("sales").sum()

customer  sale_date   product
Alice     2024-01-05  Laptop      1200
          2024-01-10  Monitor      200
          2024-01-16  Keyboard      45
          2024-01-23  Mouse          9
Bob       2024-01-07  Keyboard      40
          2024-01-17  Monitor      210
Charlie   2024-01-08  Mouse         10
          2024-01-21  Laptop      1250
David     2024-01-12  Laptop      1300
          2024-01-25  Monitor      220
Eva       2024-01-12  Mouse          8
          2024-01-20  Laptop      1400
          2024-01-26  Keyboard      38
Frank     2024-01-15  Mouse         12
          2024-01-22  Keyboard      42
Name: sales, dtype: int64

In [45]:
#indexing in Pandas

In [47]:
df.set_index("product",inplace=True)

In [50]:
df.loc["Laptop","customer":"quantity"]

        customer region  quantity
product
Laptop     Alice  North         1
Laptop     David   West         1
Laptop       Eva   West         1
Laptop   Charlie   East         2

In [ ]:
pandas --> data -- accno --> prduct id ,loan id --> index -- to fetch rows

In [52]:
df.reset_index(inplace=True)

In [54]:
df.set_index("sale_date",inplace=True)

In [56]:
df.loc["2024-01-12",:]

           product  order_id customer region  quantity  sales
sale_date
2024-01-12  Laptop         5    David   West         1   1300
2024-01-12   Mouse         6      Eva  South        10      8

In [57]:
df.reset_index(inplace=True)

In [59]:
df.set_index("region",inplace=True)

In [61]:
df.loc["North",:]

         sale_date   product  order_id customer  quantity  sales
region
North   2024-01-05    Laptop         1    Alice         1   1200
North   2024-01-10   Monitor         4    Alice         2    200
North   2024-01-15     Mouse         7    Frank         2     12
North   2024-01-22  Keyboard        12    Frank         4     42

In [62]:
df.reset_index(inplace=True)

In [65]:
df.index

RangeIndex(start=0, stop=15, step=1)

In [69]:
df['row_num']= df.index+1

In [70]:
df

   region   sale_date   product  order_id customer  quantity  sales  row_num
0   North  2024-01-05    Laptop         1    Alice         1   1200        1
1   South  2024-01-07  Keyboard         2      Bob         3     40        2
2    East  2024-01-08     Mouse         3  Charlie         5     10        3
3   North  2024-01-10   Monitor         4    Alice         2    200        4
4    West  2024-01-12    Laptop         5    David         1   1300        5
5   South  2024-01-12     Mouse         6      Eva        10      8        6
6   North  2024-01-15     Mouse         7    Frank         2     12        7
7    East  2024-01-16  Keyboard         8    Alice         1     45        8
8   South  2024-01-17   Monitor         9      Bob         1    210        9
9    West  2024-01-20    Laptop        10      Eva         1   1400       10
10   East  2024-01-21    Laptop        11  Charlie         2   1250       11
11  North  2024-01-22  Keyboard        12    Frank         4     42       12
12  South  2024-01-23     Mouse        13    Alice         6      9       13
13   West  2024-01-25   Monitor        14    David         1    220       14
14   East  2024-01-26  Keyboard        15      Eva         3     38       15

In [ ]:
rank vs dense rank

In [84]:
df['rank'] = df['sales'].rank(method="min",ascending=False)

In [85]:
df.sort_values('sales',ascending=False)

    order_id customer region   product  quantity  sales   sale_date  rank
9         10      Eva   West    Laptop         1   1400  20-01-2024   1.0
4          5    David   West    Laptop         1   1300  12-01-2024   2.0
5          6      Eva  South     Mouse        10   1300  12-01-2024   2.0
10        11  Charlie   East    Laptop         2   1250  21-01-2024   4.0
11        12    Frank  North  Keyboard         4   1250  22-01-2024   4.0
0          1    Alice  North    Laptop         1   1200  05-01-2024   6.0
8          9      Bob  South   Monitor         1    210  17-01-2024   7.0
3          4    Alice  North   Monitor         2    200  10-01-2024   8.0
7          8    Alice   East  Keyboard         1     45  16-01-2024   9.0
1          2      Bob  South  Keyboard         3     40  07-01-2024  10.0
14        15      Eva   East  Keyboard         3     38  26-01-2024  11.0
6          7    Frank  North     Mouse         2     12  15-01-2024  12.0
2          3  Charlie   East     Mouse         5     10  08-01-2024  13.0
12        13    Alice  South     Mouse         6      9  23-01-2024  14.0
13        14    David   West   Monitor         1      9  25-01-2024  14.0

In [86]:
df['dense_rank'] = df['sales'].rank(method="dense",ascending=False)

In [90]:
temp = df.sort_values('sales',ascending=False)

In [94]:
temp.iloc[0:7,:]

,order_id,customer,region,product,quantity,sales,sale_date,rank,dense_rank
9,10,Eva,West,Laptop,1,1400,20-01-2024,1.0,1.0
4,5,David,West,Laptop,1,1300,12-01-2024,2.0,2.0
5,6,Eva,South,Mouse,10,1300,12-01-2024,2.0,2.0
10,11,Charlie,East,Laptop,2,1250,21-01-2024,4.0,3.0
11,12,Frank,North,Keyboard,4,1250,22-01-2024,4.0,3.0
0,1,Alice,North,Laptop,1,1200,05-01-2024,6.0,4.0
8,9,Bob,South,Monitor,1,210,17-01-2024,7.0,5.0

In [96]:
df[((df['dense_rank']>=0) & (df['dense_rank']<=5))]

,order_id,customer,region,product,quantity,sales,sale_date,rank,dense_rank
0,1,Alice,North,Laptop,1,1200,05-01-2024,6.0,4.0
4,5,David,West,Laptop,1,1300,12-01-2024,2.0,2.0
5,6,Eva,South,Mouse,10,1300,12-01-2024,2.0,2.0
8,9,Bob,South,Monitor,1,210,17-01-2024,7.0,5.0
9,10,Eva,West,Laptop,1,1400,20-01-2024,1.0,1.0
10,11,Charlie,East,Laptop,2,1250,21-01-2024,4.0,3.0
11,12,Frank,North,Keyboard,4,1250,22-01-2024,4.0,3.0

In [97]:
df = pd.read_csv("deptwise_Sal.csv")

In [98]:
df

    empid             name    sal       dept
0     101         John Doe  55000         IT
1     102       Jane Smith  62000         HR
2     103    Michael Brown  58000    Finance
3     104      Sara Wilson  60000  Marketing
4     105    David Johnson  53000         IT
5     106      Emily Davis  61000         HR
6     107     Chris Martin  57000    Finance
7     108       Amanda Lee  59000  Marketing
8     109      Robert King  54000         IT
9     110      Laura Scott  63000         HR
10    111    Daniel Turner  56000    Finance
11    112    Olivia Harris  60500  Marketing
12    113     Ethan Walker  57500         IT
13    114      Grace Young  61500         HR
14    115     Brandon Hill  58500    Finance
15    116        Mia Adams  59500  Marketing
16    117      Kevin Baker  54500         IT
17    118        Zoe Clark  62500         HR
18    119     Jason Wright  56500    Finance
19    120       Nora Green  60000  Marketing
20    121      Tyler Evans  55000         IT
21    122  Sophia Mitchell  62000         HR
22    123      Logan Perez  58000    Finance
23    124    Chloe Roberts  61000  Marketing
24    125     Liam Stewart  59000         IT

In [100]:
df['rank'] = df.groupby("dept")["sal"].rank(method="min",ascending=False)

In [103]:
df[df['rank']==1]

    empid           name    sal       dept  rank
9     110    Laura Scott  63000         HR   1.0
14    115   Brandon Hill  58500    Finance   1.0
23    124  Chloe Roberts  61000  Marketing   1.0
24    125   Liam Stewart  59000         IT   1.0

In [107]:
df[df['dept']=='HR'].sort_values("sal",ascending=False)

    empid             name    sal dept  rank
9     110      Laura Scott  63000   HR   1.0
17    118        Zoe Clark  62500   HR   2.0
1     102       Jane Smith  62000   HR   3.0
21    122  Sophia Mitchell  62000   HR   3.0
13    114      Grace Young  61500   HR   5.0
5     106      Emily Davis  61000   HR   6.0

In [112]:
df['sales_rank'] = df.groupby("region")['sales'].rank(method="min",ascending=False)

In [118]:
df[df['sales_rank']==4]

    order_id customer region product  quantity  sales   sale_date  sales_rank
2          3  Charlie   East   Mouse         5     10  08-01-2024         4.0
6          7    Frank  North   Mouse         2     12  15-01-2024         4.0
12        13    Alice  South   Mouse         6      9  23-01-2024         4.0

In [119]:
df[df['product']=='Laptop']

    order_id customer region product  quantity  sales   sale_date  sales_rank
0          1    Alice  North  Laptop         1   1200  05-01-2024         2.0
4          5    David   West  Laptop         1   1300  12-01-2024         2.0
9         10      Eva   West  Laptop         1   1400  20-01-2024         1.0
10        11  Charlie   East  Laptop         2   1250  21-01-2024         1.0

In [121]:
df[df['sales_rank']==1]

,order_id,customer,region,product,quantity,sales,sale_date,sales_rank
5,6,Eva,South,Mouse,10,1300,12-01-2024,1.0
9,10,Eva,West,Laptop,1,1400,20-01-2024,1.0
10,11,Charlie,East,Laptop,2,1250,21-01-2024,1.0
11,12,Frank,North,Keyboard,4,1250,22-01-2024,1.0

In [125]:
df['lead'] = df['sales'].shift(-1)

In [127]:
df['lag'] = df['sales'].shift(1)

In [128]:
df

,order_id,customer,region,product,quantity,sales,sale_date,sales_rank,lead,lag
0,1,Alice,North,Laptop,1,1200,05-01-2024,2.0,40.0,NaN
1,2,Bob,South,Keyboard,3,40,07-01-2024,3.0,10.0,1200.0
2,3,Charlie,East,Mouse,5,10,08-01-2024,4.0,200.0,40.0
3,4,Alice,North,Monitor,2,200,10-01-2024,3.0,1300.0,10.0
4,5,David,West,Laptop,1,1300,12-01-2024,2.0,1300.0,200.0
5,6,Eva,South,Mouse,10,1300,12-01-2024,1.0,12.0,1300.0
6,7,Frank,North,Mouse,2,12,15-01-2024,4.0,45.0,1300.0
7,8,Alice,East,Keyboard,1,45,16-01-2024,2.0,210.0,12.0
8,9,Bob,South,Monitor,1,210,17-01-2024,2.0,1400.0,45.0
9,10,Eva,West,Laptop,1,1400,20-01-2024,1.0,1250.0,210.0
10,11,Charlie,East,Laptop,2,1250,21-01-2024,1.0,1250.0,1400.0
11,12,Frank,North,Keyboard,4,1250,22-01-2024,1.0,9.0,1250.0
12,13,Alice,South,Mouse,6,9,23-01-2024,4.0,9.0,1250.0
13,14,David,West,Monitor,1,9,25-01-2024,3.0,38.0,9.0
14,15,Eva,East,Keyboard,3,38,26-01-2024,3.0,NaN,9.0